export const questions = ([
    [
        [
            {q: 'Назначение аппарата ТА-57', a: ['Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи в домашних условиях', 'Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи', 'Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи в полевых условиях']},
            {q: 'Основные требования к КТЧ', a: ['полоса эффективно-передаваемых частот ЭППЧ при максимальной дальности связи должна быть 300-3400 Гц', 'вход и выход канала должны быть трансформаторными с номинальным сопротивлением 1200 Ом']},
            {q: 'Составной КТЧ - это', a: ['это канал, имеющий транзиты по ТЧ, т.е. состоящий из нескольких каскадно соединенных простых КТЧ', 'это канал, имеющий только транзиты по ТЧ', 'это канал, не имеющий транзиты по ТЧ, т.е. состоящий только из нескольких каскадно соединенных простых КТЧ']},
            {q: 'Блок генератора и указателя уровня (УУ) предназначен для', a: ['проверки целостности соединительных и коэффициентов нелинейных искажений', 'измерение частотных характеристик остаточного затухания телефонных каналов тональной частоты', 'измерения диаграммы внутренних уровней аппаратуры в спектре до 800 кГц']},
            {q: 'Телефон предназначен', a: ['для преобразования звуковой частоты в звуковые колебания', 'для преобразования электрических колебаний звуковой частоты в звуковые колебания', 'для преобразования электрических колебаний']},
        ],
        [
            {q: 'Назначение аппарата ТА-57', a: ['Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи в домашних условиях', 'Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи', 'Телефонный аппарат ТА-57 предназначается для обеспечения телефонной связи в полевых условиях']},
            {q: 'Какие используются мультиплексоры', a: ['МП-1, МП-2, МП-8, МП-РД', 'МП-1, МП-2, МП-8, МП-АД', 'МП-1, МП-3, МП-6, МП-АД']},
            {q: 'Основные требования к КТЧ', a: ['полоса эффективно-передаваемых частот ЭППЧ при максимальной дальности связи должна быть 300-3400 Гц', 'вход и выход канала должны быть трансформаторными с номинальным сопротивлением 1200 Ом']},
            {q: 'Составной КТЧ - это', a: ['это канал, имеющий транзиты по ТЧ, т.е. состоящий из нескольких каскадно соединенных простых КТЧ', 'это канал, имеющий только транзиты по ТЧ', 'это канал, не имеющий транзиты по ТЧ, т.е. состоящий только из нескольких каскадно соединенных простых КТЧ']},
        ],
    ],
]);

export const answerMap = [
    [
        [2,0,0,1,1],
        [2,1,0,0],
    ],
]
